#+TITLE: Incremental Learning
#+FILETAGS: perosonal @sideproject incrementallearning

toss coin to choose topics to learning

Just run the block below when I don't have any strong preference on which of these to learn.

#+BEGIN_QUOTE
Understanding triggers of your hesitation are keys to understand collections of preferences, called self.
#+END_QUOTE
Basically, if I hestitate to do what the coin tells you, just redo it.

Toss the coin by running the code below
#+BEGIN_SRC python :results output
topics = ["Emacs", "Blockchain", "Algorithm", "Prompt Programming", "Deep Learning and Data Science"]
import random

# return random.choice(topics)
print(random.choice(topics))
#+END_SRC


***** begin reading data science at commandline 2nd (https://mail.google.com/mail/u/0/#inbox/FMfcgzGmvBpgRLhhLPHmKxjwSSmdxMJF)
:LOGBOOK:
CLOCK: [2022-02-24 Thu 11:12]--[2022-02-24 Thu 11:13] =>  0:01
:END:
[2022-02-24 Thu 11:12]
[[file:~/org/school.org::*check my exam dates][check my exam dates]]
***** build my own database where I can query dataset from different machine to do data analysis. try out Amazon Athena. (what is it used for? what are other alternative?)
:LOGBOOK:
CLOCK: [2022-02-24 Thu 18:17]--[2022-02-24 Thu 18:18] =>  0:01
:END:
[2022-02-24 Thu 18:17]
[[file:~/org/PhD.org::*Meeting][Meeting]]
***** search for books on windowing system (e.g. xwindow system, wayland) the goal is to understand windowing system enough to manipulate it with my wsl2.
:LOGBOOK:
CLOCK: [2022-02-25 Fri 11:50]--[2022-02-25 Fri 11:51] =>  0:01
:END:
[2022-02-25 Fri 11:50]
***** plan out how to implement my own server. including buying server and setting things up.
:LOGBOOK:
CLOCK: [2022-02-26 Sat 14:34]--[2022-02-26 Sat 14:35] =>  0:01
:END:
[2022-02-26 Sat 14:34]
[[file:~/org/todo.org::*start daily writing and reading. (checkout template that I made for roam research to used as a building block. dont reinvent the wheel, but adjust things accordingly.)][start daily writing and reading. (checkout template that I made for roam research to used as a building block. dont reinvent the wheel, but adjust things accordingly.)]]
** learn LaTeX
:LOGBOOK:
CLOCK: [2022-03-06 Sun 12:15]--[2022-03-06 Sun 12:46] =>  0:31
CLOCK: [2022-03-06 Sun 11:26]--[2022-03-06 Sun 11:43] =>  0:17
CLOCK: [2022-03-06 Sun 10:05]--[2022-03-06 Sun 11:06] =>  1:01
CLOCK: [2022-03-06 Sun 07:56]--[2022-03-06 Sun 08:27] =>  0:31
CLOCK: [2022-03-05 Sat 16:23]--[2022-03-05 Sat 16:58] =>  0:35
CLOCK: [2022-03-05 Sat 16:19]--[2022-03-05 Sat 16:23] =>  0:04
CLOCK: [2022-03-05 Sat 13:07]--[2022-03-05 Sat 13:47] =>  0:40
CLOCK: [2022-03-05 Sat 12:36]--[2022-03-05 Sat 12:48] =>  0:12
CLOCK: [2022-03-05 Sat 11:57]--[2022-03-05 Sat 12:06] =>  0:09
CLOCK: [2022-03-05 Sat 11:30]--[2022-03-05 Sat 11:57] =>  0:27
:END:
